Revit 2024 API
TextNoteLeaderTypes Enumeration
 Types of text-note leaders
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum TextNoteLeaderTypes
Visual Basic
Public Enumeration TextNoteLeaderTypes
Visual C++
public enum class TextNoteLeaderTypes
Members
Member name | Description
TNLT_STRAIGHT_L |  A line leader attached from the left side of a text element
TNLT_STRAIGHT_R |  A line leader attached from the right side of a text element
TNLT_ARC_L |  An arc leader attached from the left side of a text element
TNLT_ARC_R |  An arc leader attached from the right side of a text element
See Also
Autodesk.Revit.DB Namespace